<?php
/**
 * Home page messages for the CodeIgniter website
 * The text blocks use markdown format.
 */
return [
	'pageTitle'		 => 'Веб фреймворк CodeIgniter',
	'jumboTitle'	 => 'CodeIgniter Rocks', // Unfortunately has no translation.
	'jumboMessage'	 => 'CodeIgniter - это мощный PHP-фреймворк с небольшой настройкой, созданный для разработчиков, которым необходим простой и элегантный инструмент для создания полнофункциональных веб-приложений.',
	'block1Title'	 => 'Скачать',
	'block1Desc'	 => 'Последняя версия ',
	'block2Title'	 => 'Читать документацию',
	'block2Desc'	 => 'Чистая документация',
	'block3Title'	 => 'Посетить форум',
	'block3Desc'	 => 'Получить помощь и обсудить вопросы',
	'block4Title'	 => 'Мы на Github',
	'block4Desc'	 => 'Исправление ошибок или добавление функций',
	'recent'		 => 'Последняя новость',
	'threads'		 => 'Активные темы форума',
	'why'			 => 'Что такое CodeIgniter ?',
	'blurb1Title'	 => 'Фреймворк с небольшими настройками',
	'blurb1Desc'	 => 'CodeIgniter 3 имеет вес в 2 МБ, включая руководство пользователя. CodeIgniter 4 - весит 1.2 мб, и 6 МБ для руководства пользователя.',
	'blurb2Title'	 => 'Простые решения по сложности',
	'blurb2Desc'	 => 'CodeIgniter поощряет MVC, но не навязывает его вам.',
	'blurb3Title'	 => 'Чистая документация',
	'blurb3Desc'	 => 'Руководство пользователя содержит введение, учебное пособие, ряд руководств по «использованию», а затем справочную документацию для компонентов, составляющих основу.',
	'blurb4Title'	 => 'Исключительная производительность',
	'blurb4Desc'	 => 'CodeIgniter стабильно превосходит большинство своих конкурентов.',
	'blurb5Title'	 => 'Сильная безопасность',
	'blurb5Desc'	 => 'Мы серьезно относимся к безопасности со встроенной защитой от CSRF и XSS атак. Версия 4 добавляет контекстно-зависимое экранирование и CSP.',
	'blurb6Title'	 => 'Почти нулевая конфигурация',
	'blurb6Desc'	 => 'Большая часть конфигурации CodeIgniter выполняется по соглашению, например, размещение моделей в папке «models». Доступно еще несколько вариантов конфигурации с помощью сценариев в папке «config».',
];
